test-plans/api-performance.jmx
<#
.SYNOPSIS
    Script para ejecutar pruebas de rendimiento JMeter en Windows
.DESCRIPTION
    Este script automatiza la ejecuciÃ³n de pruebas JMeter usando Docker
#>

param(
    [int]$Threads = 50,
    [int]$Rampup = 120, 
    [int]$Duration = 300,
    [string]$HostUrl = "https://httpbin.org"
)

Write-Host "==========================================" -ForegroundColor Cyan
Write-Host "   PRUEBAS DE RENDIMIENTO AUTOMATIZADAS   " -ForegroundColor Cyan
Write-Host "==========================================" -ForegroundColor Cyan

# FunciÃ³n para mostrar mensajes de error
function Write-ErrorMsg {
    param([string]$Message)
    Write-Host "ERROR: $Message" -ForegroundColor Red
}

# FunciÃ³n para mostrar mensajes de Ã©xito
function Write-SuccessMsg {
    param([string]$Message)
    Write-Host "OK: $Message" -ForegroundColor Green
}

# 1. Verificar Docker
Write-Host "`n[1/5] Verificando Docker..." -ForegroundColor Yellow
try {
    $dockerVersion = docker --version
    Write-SuccessMsg "Docker detectado: $dockerVersion"
} catch {
    Write-ErrorMsg "Docker no estÃ¡ disponible. Instala Docker Desktop"
    exit 1
}

# Verificar que Docker estÃ© ejecutÃ¡ndose
try {
    docker ps > $null
    Write-SuccessMsg "Docker Desktop estÃ¡ ejecutÃ¡ndose"
} catch {
    Write-ErrorMsg "Docker Desktop no estÃ¡ ejecutÃ¡ndose"
    exit 1
}

# 2. Verificar y descargar imagen JMeter
Write-Host "`n[2/5] Configurando imagen JMeter..." -ForegroundColor Yellow
$JMETER_IMAGE = "justb4/jmeter:5.6.3"

# Verificar si la imagen existe localmente
$localImage = docker images --quiet $JMETER_IMAGE

if (-not $localImage) {
    Write-Host "Descargando imagen JMeter..." -ForegroundColor Yellow
    try {
        docker pull $JMETER_IMAGE
        Write-SuccessMsg "Imagen JMeter descargada"
    } catch {
        Write-ErrorMsg "No se pudo descargar la imagen JMeter"
        exit 1
    }
} else {
    Write-SuccessMsg "Imagen JMeter encontrada"
}

# 3. Verificar archivos de prueba
Write-Host "`n[3/5] Verificando archivos de prueba..." -ForegroundColor Yellow

if (-not (Test-Path "test-plans/api-performance.jmx")) {
    Write-ErrorMsg "No se encuentra test-plans/api-performance.jmx"
    Write-Host "Creando archivo bÃ¡sico de JMeter..." -ForegroundColor Yellow
    # Crearemos un archivo JMX bÃ¡sico
    @'
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="threads" elementType="Argument">
            <stringProp name="Argument.name">threads</stringProp>
            <stringProp name="Argument.value">50</stringProp>
          </elementProp>
          <elementProp name="rampup" elementType="Argument">
            <stringProp name="Argument.name">rampup</stringProp>
            <stringProp name="Argument.value">120</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">httpbin.org</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/get</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>